Autodesk.Revit.UI.FileSaveDialog.InitialFileName
The initial file name to be shown for this save operation.
This would typically be a name derived by the application that matches the purpose of the save operation
it intends to do.  The user is permitted to alter the initial file name.
If the extension is not included, the file would be given the selected file extension
for the active filter (when saved).  If the extension is included, it will be ignored if the extension does
not match one of the possible filter extensions. When not set, the file name entry field in the dialog will
be blank and the user will have to enter a file name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: initialFileName cannot include prohibited unprintable characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.UI.FileSaveDialog.#ctor(System.String)
Constructs a new instance of a File Save dialog.
filter:
The filter string.  See the remarks for Autodesk.Revit.UI.FileDialog.Filter for details.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input filter string does not meet the minimal requirements for a valid filter string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017